In [1]:
import pandas as pd

In [2]:
s1 = pd.Series([12,24,36,12,6,12,24], index=['apples','oranges','bananas', 'samosas','rolls', 'chickens', 'coldrinks'])

In [3]:
s1

apples       12
oranges      24
bananas      36
samosas      12
rolls         6
chickens     12
coldrinks    24
dtype: int64

In [4]:
s1.index

Index(['apples', 'oranges', 'bananas', 'samosas', 'rolls', 'chickens',
       'coldrinks'],
      dtype='object')

In [6]:
print (s1)

apples       12
oranges      24
bananas      36
samosas      12
rolls         6
chickens     12
coldrinks    24
dtype: int64

In [7]:
s1.values

array([12, 24, 36, 12,  6, 12, 24], dtype=int64)

In [17]:
# ye neeche likhe teeno command same hain
#s1[0]
s1['apples']
#s1.iloc[0] iss command ka faida ye hai ke woh notification show nhi hoti

12

In [9]:
s1*2

apples       24
oranges      48
bananas      72
samosas      24
rolls        12
chickens     24
coldrinks    48
dtype: int64

In [30]:
s1.index[0], s1['apples']

('apples', 12)

In [31]:
# Creating a DataFrame from a dictionary
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'San Francisco', 'Los Angeles']
}
df = pd.DataFrame(data)

print("Pandas DataFrame:")
df

Pandas DataFrame:

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [62]:
# Creating a data frame
result = {'name':          ['Alpha','Bravo', 'Charlie','Delta','Echo','Foxtrot','Golf','Hotel','India','Juliet'],
          'roll':          [11,22,33,44,55,66,77,88,99,111],
          'python':        [78,67,89,59,90,72,76,89,67,85],
          'excel':         [89,87,67,74,78,90,76,78,90,54],
           'power_bi':     [45,67,89,87,67,90,65,67,56,90],
          'pandas':        [81,85,89,87,41,45,96,56,93,78],
        'machine_learning':[96,95,84,85,82,81,74,75,96,90],
         'statistics':     [67,48,45,98,75,71,70,60,90,93]}

df1 = pd.DataFrame(result)
df1

,name,roll,python,excel,power_bi,pandas,machine_learning,statistics
0,Alpha,11,78,89,45,81,96,67
1,Bravo,22,67,87,67,85,95,48
2,Charlie,33,89,67,89,89,84,45
3,Delta,44,59,74,87,87,85,98
4,Echo,55,90,78,67,41,82,75
5,Foxtrot,66,72,90,90,45,81,71
6,Golf,77,76,76,65,96,74,70
7,Hotel,88,89,78,67,56,75,60
8,India,99,67,90,56,93,96,90
9,Juliet,111,85,54,90,78,90,93

In [33]:

print("Shape of DataFrame:", df.shape)

Shape of DataFrame: (3, 3)

In [34]:
# i am printing shape of df1 which is (10, 8) because there are 10 rows and 8 columns
print("Shape of DataFrame:", df1.shape)

Shape of DataFrame: (10, 8)

In [53]:
print(df.describe())
# ye function aapke table mai se rows ke stats batata hai (sirf un columns ka batata hai jinme numbers hotay hain)

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [63]:
print(df1.describe())

             roll     python      excel   power_bi     pandas  \
count   10.000000  10.000000  10.000000  10.000000  10.000000
mean    60.600000  77.200000  78.300000  72.300000  75.100000
std     33.470385  10.911767  11.576317  15.881855  20.184978
min     11.000000  59.000000  54.000000  45.000000  41.000000
25%     35.750000  68.250000  74.500000  65.500000  61.500000
50%     60.500000  77.000000  78.000000  67.000000  83.000000
75%     85.250000  88.000000  88.500000  88.500000  88.500000
max    111.000000  90.000000  90.000000  90.000000  96.000000

       machine_learning  statistics
count         10.000000   10.000000
mean          85.800000   71.700000
std            8.216515   18.037307
min           74.000000   45.000000
25%           81.250000   61.750000
50%           84.500000   70.500000
75%           93.750000   86.250000
max           96.000000   98.000000

In [37]:
df1.columns
#columns print karne ke liye functions 
#aap iss function ko use karke rename bhi kar sakte ho column ki values

Index(['name', 'roll', 'python', 'excel', 'power_bi', 'pandas',
       'machine_learning', 'statistics'],
      dtype='object')

In [40]:
df1.columns = ['Name','Roll','Python','Excel','Power_bi','Pandas','Machine_learning','Statistics']
df1.columns
#change hojayen gi ab names columns ki

Index(['Name', 'Roll', 'Python', 'Excel', 'Power_bi', 'Pandas',
       'Machine_learning', 'Statistics'],
      dtype='object')

In [77]:
df1
#yahan bhi change hojayen gi names columns ki (mene wese sirf capital kara hai first letter ko)

,name,roll,python,excel,power_bi,pandas,machine_learning,statistics
0,Alpha,11,78,89,45,81,96,67
1,Bravo,22,67,87,67,85,95,48
2,Charlie,33,89,67,89,89,84,45
3,Delta,44,59,74,87,87,85,98
4,Echo,55,90,78,67,41,82,75
5,Foxtrot,66,72,90,90,45,81,71
6,Golf,77,76,76,65,96,74,70
7,Hotel,88,89,78,67,56,75,60
8,India,99,67,90,56,93,96,90
9,Juliet,111,85,54,90,78,90,93

In [81]:
df1.rename(columns={'roll':'Id', 'statistics':"Stats"})
# iss tarah custom apni marzi ki column ka name change kar sakte hain lekin woh permanent nhi hota sirf one time change hota hai 
# means ke woh memory mai update nhi hota

      name   Id  python  excel  power_bi  pandas  machine_learning  Stats
0    Alpha   11      78     89        45      81                96     67
1    Bravo   22      67     87        67      85                95     48
2  Charlie   33      89     67        89      89                84     45
3    Delta   44      59     74        87      87                85     98
4     Echo   55      90     78        67      41                82     75
5  Foxtrot   66      72     90        90      45                81     71
6     Golf   77      76     76        65      96                74     70
7    Hotel   88      89     78        67      56                75     60
8    India   99      67     90        56      93                96     90
9   Juliet  111      85     54        90      78                90     93

In [82]:
df1
#ab dekho woh dubara purana walay columns show ho rahay name change nhi hua

,name,roll,python,excel,power_bi,pandas,machine_learning,statistics
0,Alpha,11,78,89,45,81,96,67
1,Bravo,22,67,87,67,85,95,48
2,Charlie,33,89,67,89,89,84,45
3,Delta,44,59,74,87,87,85,98
4,Echo,55,90,78,67,41,82,75
5,Foxtrot,66,72,90,90,45,81,71
6,Golf,77,76,76,65,96,74,70
7,Hotel,88,89,78,67,56,75,60
8,India,99,67,90,56,93,96,90
9,Juliet,111,85,54,90,78,90,93

In [83]:
df1.rename(columns={'roll':'Id', 'statistics':"Stats"},inplace=True)
# iss tarah permanent change hojayega name matlab memory mai change hojayega

In [84]:
df1
#check karlo hogayi change

      name   Id  python  excel  power_bi  pandas  machine_learning  Stats
0    Alpha   11      78     89        45      81                96     67
1    Bravo   22      67     87        67      85                95     48
2  Charlie   33      89     67        89      89                84     45
3    Delta   44      59     74        87      87                85     98
4     Echo   55      90     78        67      41                82     75
5  Foxtrot   66      72     90        90      45                81     71
6     Golf   77      76     76        65      96                74     70
7    Hotel   88      89     78        67      56                75     60
8    India   99      67     90        56      93                96     90
9   Juliet  111      85     54        90      78                90     93

In [85]:
# Selecting a specific column
ages = df['Age']
print("Ages of individuals:")
print(ages)

Ages of individuals:
0    25
1    30
2    35
Name: Age, dtype: int64

In [86]:
# Selecting rows where Age is greater than 30
older_people = df[df['Age'] > 30]
print("Individuals with Age greater than 30:")
print(older_people)

Individuals with Age greater than 30:
      Name  Age         City
2  Charlie   35  Los Angeles

In [87]:
# Adding a new column
df['Salary'] = [50000, 60000, 70000]
print("DataFrame with Salary column added:")
print(df)

DataFrame with Salary column added:
      Name  Age           City  Salary
0    Alice   25       New York   50000
1      Bob   30  San Francisco   60000
2  Charlie   35    Los Angeles   70000

In [88]:
# Modifying the values of the 'Age' column
df['Age'] = df['Age'] + 1
print("Updated Ages:")
print(df)

Updated Ages:
      Name  Age           City  Salary
0    Alice   26       New York   50000
1      Bob   31  San Francisco   60000
2  Charlie   36    Los Angeles   70000

In [89]:
# # Removing a column

# The axis parameter specifies whether you want to remove rows or columns.
    # axis=0 refers to rows.
    # axis=1 refers to columns.
# Without specifying axis=1, Pandas would assume you're trying to drop a row (since axis=0 is the default for many operations
df = df.drop('Salary', axis=1)
print("DataFrame after removing Salary column:")
print(df)

DataFrame after removing Salary column:
      Name  Age           City
0    Alice   26       New York
1      Bob   31  San Francisco
2  Charlie   36    Los Angeles

In [90]:
# Dropping a row (row index 1)
df = df.drop(1, axis=0)

print(df)

      Name  Age         City
0    Alice   26     New York
2  Charlie   36  Los Angeles